alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
/********** Cheap AI Chat Keyboard — ESP32-C3 + CYD28 + ESP32-S2 Mini **********
* 060426 TARGET_EPAPER: halDeepSleep() after 5 min idle; skip initial screen clear on deep sleep wake
* 030426
* 030426 Add #define DEBUG_SERIAL Needs to be // out to allow CPU sleep (Gemini)
* 050426 WiFi idle timeout: 120s → 125s → 60s
* 010426 Power: tickless idle sleep (esp_pm), WiFi idle timeout, wake-on-keystroke (Gemini)
* 010426 Change title (except SLUG) to CRACK: Cheap Remote AI Chat Keyboard
* 010426 AI system prompt: unified macro AI_SYSTEM_PROMPT; 80-word limit for epaper, 120 otherwise
* 010426 E-paper: word-wrap uses correct font per message; epdShowModel; epdPromptInInputRow
* 310326 WiFi power save: PS_NONE during API calls, MAX_MODEM idle (all targets)
* 310326 CPU 80 MHz for C3 (setCpuFrequencyMhz); epdMsgPending rate-limit bypass
* 300326 WiFi signal icon (dot + 3 arcs) bottom-right of C3/S2 input bar; refreshes every 2s
* 300326 INPUT_DELETE (Del=forward-delete) and INPUT_MODEL_MENU (Home=model menu) added
* 290326 Add ESP32-S2 Mini target (env:s2mini): USB HID keyboard via USB-C OTG, GPIO LED
* 240326 Cursor movement: left/right arrows move insertion point; insert/delete at cursor
* 240326 Gemini request: PrintBuffer flushes serializeJson in 1KB chunks (fixes TLS write failure)
* 240326 Gemini request: serialize directly to socket via measureJson+PrintBuffer (no String body)
* 240326 Gemini response: adaptive reserve cap based on largest free heap block after TLS
* 240326 Gemini response: reserve fullResp after reqDoc freed to avoid three-way heap pressure
* 240326 Cursor visible in input bar: 2px bar drawn at inputCursor position in all render paths
* 240326 Light mode: all pages (model menu, AP scan, KB connect) use invertDisplay colours
* 240326 Font switch: FONT_LOAD/FONT_UNLOAD macros from font.h; add FONT_BUILTIN_16PX option
* 240326 Font switch: font.h #define FONT_18PX selects 18px/22px or 12px/15px font system-wide
* 240326 enterPassword C3: sprite-per-row rendering to clear AP scan and fill blank rows
* 240326 Fix 'g' clipping: corrected LINE_H_LARGE=15, TXT_H=15 to match VLW yAdvance
* 090326 Key click: 4 kHz squarewave 10 ms on GPIO 26 speaker (LEDC ch 3)
* 040326 Unicode fonts: VLW smooth fonts, Latin Extended + special chars, remove transliteration
* 030326 Touch calibration: key C at boot, 2-point crosshair, saved to NVS
* 030326 Transliterate accented chars (Latin-1, Latin Extended-A) to ASCII in addMessage
* 030326 Add Groq API (api.groq.com), model qwen/qwen3-32b, key 5 at boot
* 030326 WiFi AP menu bugfixes: disconnect before scan, redraw KB after selectAP
* 030326 WiFi AP menu: NVS credential store, AP scan/picker, enterPassword, selectAP
* 020326 KB layout: BS height 40px, Hide aligned to dot key, clear KB remnants on Send
* 280226 Add Grok API (xAI), key 4 at boot; route callGemini/callGrok via useGrok flag
* 280226 Bold font: custom DejaVuSansBold 12px (yAdv=15), LINE_H_LARGE=15 SPLASH_H=45
* 280226 RGB LED WiFi signal strength: blue=strong, cyan, green, orange, red=lost
* 270226 Fix large-font truncation: grow Message.text→2048, full→2060, buffers; setTextWrap(false)
* 270226 WiFi health ping, red > on fail, reconnect; global endpoint for Flash
* 270226 Alt key: number row + ,./ alt layer, mutual exclusion with shift
* 270226 Memory tuning and final polish
* 270226 Initial scaffold
**********************************************************************************************/

#include <Arduino.h>
#include <SPI.h>
#ifdef TARGET_EPAPER
#  include "display_epaper.h"  // GxEPD2 wrapper; defines FONT_LINE_H, TFT_eSprite alias, etc.
#  include "esp_sleep.h"	   //allow low power op - precompiled FreeRTOS kernel intentionally disables Automatic Tickless Idle
#else
#  include <TFT_eSPI.h>
#  include "font.h"                        // selects 12px or 18px font via FONT_18PX
#  include "fonts/DejaVuSansBold8px.h"   // VLW smooth font 10px (Unicode)
#endif
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <esp_wifi.h>  // esp_wifi_set_ps() — WIFI_PS_MAX_MODEM / WIFI_PS_NONE
#include <driver/gpio.h>  // gpio_hold_en() / gpio_hold_dis() for deep sleep pin latch
#include <ArduinoJson.h>
#ifndef TARGET_C3
#include <ESP32Ping.h>
#endif
#include <Preferences.h>
#include "hal.h"

//#define DEBUG_SERIAL true				//comment out for low power. Serial on stops CPU Light Sleep	

// --- Credentials (kept out of version control) ---
#include "secrets.h"  // copy secrets.h.example → secrets.h and fill in your keys
char        GEMINI_MODEL[48]  = "gemini-3.1-pro-preview"; // overwritten at boot
bool        geminiUseGlobal   = false;  // true → /locations/global/ in path
bool        useGrok           = false;  // true → route to Grok (xAI) instead of Gemini
bool        useGroq           = false;  // true → route to Groq instead of Gemini
// Font selected via FONT_18PX in font.h; FONT_DATA / FONT_LINE_H etc. set there.
bool        invertDisplay     = true;   // true = Light Theme (light bg, black text)
#define COL_INVERT_BG   0xC618          // light grey (~RGB 192,192,192)
#ifdef TARGET_EPAPER
#  undef  COL_INVERT_BG
#  define COL_INVERT_BG  0xFFFF   // true white for e-paper (0xC618 maps to black via mapCol)
#endif

// --- WiFi credential store (NVS, up to 9 slots, slot 0 = most-recently-used) ---
#define WIFI_PREFS_MAX  9
#define WIFI_PREFS_NS   "wifi"

static char wifiSsid[WIFI_PREFS_MAX][33];  // SSID max 32 chars + null
static char wifiPass[WIFI_PREFS_MAX][64];  // WPA2 password max 63 chars + null
static int  wifiCredsCount = 0;

void saveWifiCreds() {
    Preferences p;
    p.begin(WIFI_PREFS_NS, false);
    p.putInt("n", wifiCredsCount);
    for (int i = 0; i < wifiCredsCount; i++) {
        char sk[4], pk[4];
        snprintf(sk, sizeof(sk), "s%d", i);
        snprintf(pk, sizeof(pk), "p%d", i);
        p.putString(sk, wifiSsid[i]);
        p.putString(pk, wifiPass[i]);
    }
    p.end();
}

void loadWifiCreds() {
    Preferences p;
    p.begin(WIFI_PREFS_NS, true);
    wifiCredsCount = p.getInt("n", 0);
    if (wifiCredsCount > WIFI_PREFS_MAX) wifiCredsCount = WIFI_PREFS_MAX;
    for (int i = 0; i < wifiCredsCount; i++) {
        char sk[4], pk[4];
        snprintf(sk, sizeof(sk), "s%d", i);
        snprintf(pk, sizeof(pk), "p%d", i);
        strncpy(wifiSsid[i], p.getString(sk, "").c_str(), 32); wifiSsid[i][32] = '\0';
        strncpy(wifiPass[i], p.getString(pk, "").c_str(), 63); wifiPass[i][63] = '\0';
    }
    p.end();
}

// Insert ssid+pass at slot 0 (most-recently-used). Shift others down. Cap at WIFI_PREFS_MAX.
void insertWifiCred(const char* ssid, const char* pass) {
    // Remove existing entry for this SSID if present
    for (int i = 0; i < wifiCredsCount; i++) {
        if (strcmp(wifiSsid[i], ssid) == 0) {
            for (int j = i; j < wifiCredsCount - 1; j++) {
                strncpy(wifiSsid[j], wifiSsid[j+1], 32); wifiSsid[j][32] = '\0';
                strncpy(wifiPass[j], wifiPass[j+1], 63); wifiPass[j][63] = '\0';
            }
            wifiCredsCount--;
            break;
        }
    }
    int newCount = wifiCredsCount + 1;
    if (newCount > WIFI_PREFS_MAX) newCount = WIFI_PREFS_MAX;
    for (int i = newCount - 1; i > 0; i--) {
        strncpy(wifiSsid[i], wifiSsid[i-1], 32); wifiSsid[i][32] = '\0';
        strncpy(wifiPass[i], wifiPass[i-1], 63); wifiPass[i][63] = '\0';
    }
    strncpy(wifiSsid[0], ssid, 32); wifiSsid[0][32] = '\0';
    strncpy(wifiPass[0], pass, 63); wifiPass[0][63] = '\0';
    wifiCredsCount = newCount;
    saveWifiCreds();
}

// Returns true and fills passOut (64 bytes) if password stored for ssid.
bool findWifiPass(const char* ssid, char* passOut) {
    for (int i = 0; i < wifiCredsCount; i++) {
        if (strcmp(wifiSsid[i], ssid) == 0) {
            strncpy(passOut, wifiPass[i], 63); passOut[63] = '\0';
            return wifiPass[i][0] != '\0';  // false if stored but blank
        }
    }
    return false;
}

// Blank the stored password for ssid (force re-entry next time).
void clearWifiPass(const char* ssid) {
    for (int i = 0; i < wifiCredsCount; i++) {
        if (strcmp(wifiSsid[i], ssid) == 0) {
            wifiPass[i][0] = '\0';
            saveWifiCreds();
            return;
        }
    }
}

// --- Screen dimensions ---
#ifdef TARGET_P3
#  define SCREEN_W      284   // ST7789P3 display module (part no.), 284×76 landscape, ESP32-C3
#  define SCREEN_H       76
#elif defined(TARGET_EPAPER)
#  define SCREEN_W      EPD_WIDTH   // set by EPD_SIZE_xxx in display_epaper.h
#  define SCREEN_H      EPD_HEIGHT
#else
#  define SCREEN_W      320
#  define SCREEN_H      240
#endif
//#define ROTATE_180          // uncomment to rotate display 180° (USB on left)

// --- Layout (KB shown) ---
#define HIST_Y_TOP      0
#define HIST_H_KB_SHOW  116
#define IBAR_Y_KB_SHOW  116
#define IBAR_H_KB_SHOW   20
#define KB_Y            136
#define KB_H            104

