alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    // Short user prompt: replace input row with prompt, keep existing history in place (no scroll).
    if (epdPromptInInputRow) {
        epdPromptInInputRow = false;
        int displayCount = lineCount - 1;   // exclude the just-added user message
        int fi = displayCount - histSlots;
        if (fi < 0) fi = 0;

        tft.beginFrame();
        tft.epd.fillScreen(GxEPD_WHITE);
        tft.u8g2.setForegroundColor(GxEPD_BLACK);
        tft.u8g2.setBackgroundColor(GxEPD_WHITE);
        for (int i = 0; i < histSlots; i++) renderSlot(i, fi, displayCount);

        // Prompt in input row: italic, right-aligned, no cursor line
        tft.u8g2.setFont(EPD_FONT_USER);
        int32_t pw = (int32_t)tft.u8g2.getUTF8Width(epdPromptBuf);
        tft.u8g2.setCursor(SCREEN_W - (int)pw - 2, inputY + EPD_FONT_ASCENT);
        tft.u8g2.print(epdPromptBuf);
        tft.endFrame();
        return;
    }

    // Normal full-screen render (AI response, scroll, model change, etc.)
    tft.beginFrame();
    tft.epd.fillScreen(GxEPD_WHITE);
    tft.u8g2.setForegroundColor(GxEPD_BLACK);
    tft.u8g2.setBackgroundColor(GxEPD_WHITE);
    for (int i = 0; i < histSlots; i++) renderSlot(i, firstIdx, lineCount);

    // Input row
    {
        tft.u8g2.setFont(EPD_FONT);
        if (epdSleeping) {
            tft.epd.fillRect(0, inputY, SCREEN_W, lineH, GxEPD_BLACK);
            tft.u8g2.setForegroundColor(GxEPD_WHITE);
            tft.u8g2.setBackgroundColor(GxEPD_BLACK);
            tft.u8g2.setCursor(2, inputY + EPD_FONT_ASCENT);
            tft.u8g2.print("Sleeping... press WAKE to wake");
            tft.u8g2.setForegroundColor(GxEPD_BLACK);
            tft.u8g2.setBackgroundColor(GxEPD_WHITE);
        } else {
            tft.u8g2.setCursor(2, inputY + EPD_FONT_ASCENT);
            tft.u8g2.print("> ");
            int32_t promptW = tft.textWidth("> ");
            int start = inputCursor;
            int availW = SCREEN_W - (int)promptW - 4;
            while (start > 0) {
                char tmp[INPUT_BUF_SIZE];
                int len = inputCursor - (start - 1);
                strncpy(tmp, inputBuf + start - 1, len);
                tmp[len] = '\0';
                if ((int)tft.textWidth(tmp) > availW - 2) break;
                start--;
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            tft.u8g2.setCursor(2 + (int)promptW, inputY + EPD_FONT_ASCENT);
            tft.u8g2.print(dispBuf);
            char preCur[INPUT_BUF_SIZE] = {0};
            strncpy(preCur, inputBuf + start, inputCursor - start);
            int curX = 2 + (int)promptW + (int)tft.textWidth(preCur);
            tft.epd.drawLine(curX, inputY + 1, curX, inputY + lineH - 2, GxEPD_BLACK);
        }
    }

    tft.endFrame();
    return;
#endif

#ifdef TARGET_C3
    // Render each line to a RAM sprite, then push to display in one SPI block.
    // This avoids repeated setWindow/pushBlock transitions that cause partial
    // screen updates on ESP32-C3 (SPI register sync issue without DMA).
    // Falls back to direct TFT drawing if heap is too fragmented.
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);

    // Pre-fill background before any sprite push.
    tft.fillRect(0, 0, SCREEN_W, histH, bg);

    // Slot 0: model heading — lineH+4 tall to avoid clipping descenders (g, q, y).
    // Drawn in its own create/delete pass so no two sprites are alive simultaneously.
    if (spr.createSprite(SCREEN_W, lineH + 4)) {
        FONT_LOAD(spr);
        const char* modelLabel = useGrok ? "Grok 4.1 Fast" :
                                 useGroq ? "Groq OSS-120b" : GEMINI_MODEL;
        spr.fillSprite(bg);
        spr.setTextColor(invertDisplay ? TFT_DARKGREEN : TFT_GREEN, bg);
        spr.drawString(modelLabel, 2, 0);
        FONT_UNLOAD(spr);
        spr.pushSprite(0, 0);
        spr.deleteSprite();
    }

    if (spr.createSprite(SCREEN_W, lineH)) {
        FONT_LOAD(spr);
        spr.setTextWrap(false);

        for (int i = 0; i < histSlots; i++) {
            spr.fillSprite(bg);
            if ((firstIdx + i) < lineCount) {
                int idx = firstIdx + i;
                uint16_t col = lineColor[idx];
                if (invertDisplay && col != COL_ERROR) {
                    col = lineIsUser[idx] ? COL_USER_LIGHT : TFT_BLACK;
                }
                spr.setTextColor(col, bg);
                if (lineIsUser[idx]) {
                    spr.setTextDatum(TR_DATUM);
                    spr.drawString(lines[idx], SCREEN_W, 0);
                    spr.setTextDatum(TL_DATUM);
                } else {
                    spr.drawString(lines[idx], 2, 0);
                }
            }
            spr.pushSprite(0, (i + 1) * lineH);  // +1: slot 0 is the heading
        }

        // Input line — always the last visible slot
        {
            spr.fillSprite(bg);
            spr.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            spr.drawString("> ", 2, 0);
            int promptW = spr.textWidth("> ");
            spr.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            int availW = SCREEN_W - promptW - 4;
            // Scroll so cursor is always visible
            int start = inputCursor;
            while (start > 0) {
                char tmp[INPUT_BUF_SIZE];
                int len = inputCursor - (start - 1);
                strncpy(tmp, inputBuf + start - 1, len);
                tmp[len] = '\0';
                if (spr.textWidth(tmp) > availW - 2) break;
                start--;
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            spr.drawString(dispBuf, 2 + promptW, 0);
            // Cursor at inputCursor position
            char preCur[INPUT_BUF_SIZE] = {0};
            strncpy(preCur, inputBuf + start, inputCursor - start);
            int curX = 2 + promptW + spr.textWidth(preCur);
            spr.fillRect(curX, 2, 1, lineH - 4, invertDisplay ? TFT_DARKGREY : TFT_YELLOW);
            spr.pushSprite(0, (maxVis - 1) * lineH);  // last slot, after heading + histSlots chat lines
        }

        FONT_UNLOAD(spr);
        spr.deleteSprite();

