alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    return "ERR: no text in response";
}

String callGroq(const char* prompt) {
    // Groq: OpenAI-compatible /openai/v1/chat/completions
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    showWaiting("Thinking...");
    if (!client.connect(GROQ_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    // Build + send in inner scope to free reqDoc and body before reading response
    {
        JsonDocument reqDoc;
        reqDoc["model"]  = GROQ_MODEL;
        reqDoc["stream"] = false;

        JsonArray messages = reqDoc["messages"].to<JsonArray>();
        JsonObject sysMsgObj = messages.add<JsonObject>();
        sysMsgObj["role"]    = "system";
        sysMsgObj["content"] = AI_SYSTEM_PROMPT;

        for (int i = 0; i < historyCount - 1; i++) {
            if (history[i].displayOnly) continue;
            JsonObject msg  = messages.add<JsonObject>();
            msg["role"]     = history[i].isUser ? "user" : "assistant";
            msg["content"]  = history[i].text;
        }
        JsonObject curMsg  = messages.add<JsonObject>();
        curMsg["role"]     = "user";
        curMsg["content"]  = prompt;

        String body;
        serializeJson(reqDoc, body);
        client.printf(
            "POST /openai/v1/chat/completions HTTP/1.0\r\n"
            "Host: " GROQ_HOST "\r\n"
            "Content-Type: application/json\r\n"
            "Authorization: Bearer %s\r\n"
            "Content-Length: %d\r\n\r\n",
            GROQ_API_KEY, (int)body.length());
        client.print(body);
        // reqDoc and body freed here
    }

    // Reserve response buffer — avoids realloc fragmentation under heap pressure
    String fullResp;
    {
        size_t avail = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
        const size_t RESP_CAP = (avail > 5120) ? min((size_t)6144, avail - 1024) : 0;
        if (RESP_CAP > 0) fullResp.reserve(RESP_CAP);
    }
    uint8_t rbuf[256];
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    unsigned long lastData  = millis();
    bool receivedAny = false;
    while (millis() < deadline) {
        int n = client.read(rbuf, sizeof(rbuf));
        if (n > 0) {
            lastData = millis();
            receivedAny = true;
            fullResp.concat((const char*)rbuf, n);
            continue;
        }
        if (receivedAny && !client.connected()) break;
        if (receivedAny && millis() - lastData > 1000) break;
        if (!receivedAny && millis() - lastData > 15000) break;
        if (WiFi.status() != WL_CONNECTED) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
#ifndef TARGET_C3
        pollKBHide();
#endif
        delay(10);
    }
    client.stop();
    Serial.printf("[Groq] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    // Filter: only extract fields we need — avoids allocating full JSON tree under heap pressure
    JsonDocument filter;
    filter["choices"][0]["message"]["content"] = true;
    filter["error"]["message"] = true;
    JsonDocument respDoc;
    if (deserializeJson(respDoc, fullResp.c_str() + jsonStart,
                        DeserializationOption::Filter(filter)) != DeserializationError::Ok) {
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // OpenAI-compatible: choices[0].message.content
    const char* text = respDoc["choices"][0]["message"]["content"];
    if (text) return String(text);

    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
#ifdef TARGET_C3
    showStatusLine("Thinking...", TFT_DARKGREY);
    return;
#endif
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    fontOn();
    tft.drawString("Thinking...", 2, barY + (barH - TXT_H) / 2);
    fontOff();
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (historyCount == 0) return;  // no conversation yet — ignore
        strncpy(prompt, "Tell me more", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
        inputCursor = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
#ifndef TARGET_C3
    kbVisible = false;   // hide KB; drawHistory() covers the KB area
#endif
#ifndef TARGET_EPAPER
    drawInputBar();      // clear full bar now — erases BS/Hide key remnants before API wait
#endif

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API — deinit NimBLE on C3 to free ~30KB heap for TLS buffers.
    halBeforeApiCall();
    if (WiFi.status() != WL_CONNECTED) {
        WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
    }
    String response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    // Retry once only if WiFi actually dropped — server-side empty responses don't warrant
    // a retry (would just stack another 8s timeout on an already-bad connection).
    if (response == "ERR: empty response" && WiFi.status() != WL_CONNECTED) {
        WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
        if (WiFi.status() == WL_CONNECTED)
            response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    }
    halAfterApiCall();

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    wifiHealthy = (WiFi.status() == WL_CONNECTED);  // refresh after API call; LED uses RSSI independently
#ifndef TARGET_EPAPER
    drawInputBar();  // epaper: "> " already rendered in the full frame from addMessage() above
#endif
}

#ifndef TARGET_C3
void drawCrosshair(int x, int y) {
    tft.drawLine(x - 18, y, x + 18, y, TFT_WHITE);
    tft.drawLine(x, y - 18, x, y + 18, TFT_WHITE);
    tft.drawCircle(x, y, 6, TFT_WHITE);
}
#endif

