alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void selectModel() {
#ifdef TARGET_EPAPER
    bool sessionAvail = halIsDeepSleepWake();
#else
    bool sessionAvail = false;
#endif
    showModelChoices(sessionAvail);

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }
        if (ev.type != INPUT_CHAR) continue;
        char ch = ev.ch;

        // Check model keys against table
        for (int i = 0; i < NUM_MODELS; i++) {
            if (ch != MODEL_DEFS[i].key) continue;
#ifdef TARGET_P3
            if (!MODEL_DEFS[i].p3) continue;  // key not offered on P3
#endif
            halClickSound();
            const ModelDef& m = MODEL_DEFS[i];
            if (m.apiId) {
                strlcpy(GEMINI_MODEL, m.apiId, sizeof(GEMINI_MODEL));
                geminiUseGlobal = m.global;
                useGrok = false; useGroq = false;
            } else {
                useGrok = m.isGrok; useGroq = m.isGroq;
            }
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
#ifdef TARGET_C3
            c3Line(0,             "CRACK: Cheap Remote AI Chat Keyboard", TFT_GREEN,    bg);
            c3Line(LINE_H_P3,     m.name,                                 TFT_GREEN,    bg);
            c3Line(2*LINE_H_P3,   "Ready.",                               TFT_DARKGREY, bg);
#else
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("CRACK: Cheap Remote AI Chat Keyboard", 2, 0);
            tft.drawString(m.name, 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
#endif
            return;
        }
#ifdef TARGET_EPAPER
        if (ch == 'r' || ch == 'R') {
            if (loadSession()) {
                epdMsgPending = true;
                epdShowModel  = false;
                drawHistory();
                return;
            }
            continue;
        }
#endif
        if (ch == 'd' || ch == 'D') {
            invertDisplay = !invertDisplay;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(bg);
            drawInputBar();
#ifdef TARGET_C3
            c3Line(0,          "CRACK: Cheap Remote AI Chat Keyboard", invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            c3Line(2 * LINE_H_P3,  "Select AI model:",       invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
#else
            uiFontOn(); tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            tft.drawString("CRACK: Cheap Remote AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, 2 * TXT_H + 4);
            uiFontOff();
#endif
            showModelChoices(sessionAvail);
            continue;
        }
#ifndef TARGET_C3
        if (ch == 'c' || ch == 'C') {
            calibrateTouch();
            tft.fillScreen(COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.drawString("CRACK: Cheap Remote AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, 2 * TXT_H);
            uiFontOff();
            drawKeyboard();
            drawInputBar(); showModelChoices(sessionAvail);
            continue;
        }
#endif
    }
}

void setup() {
#ifdef DEBUG_SERIAL
    Serial.begin(115200);
#endif


#if defined(TARGET_C3) && !defined(TARGET_EPAPER3V3)
    delay(1500);  // USB CDC needs time to enumerate before first output
#endif
#if defined(TARGET_C3) && !defined(TARGET_S2)
    // 80 MHz: minimum frequency for stable WiFi+BLE radio sync; saves ~10 mA vs 160 MHz default.
    setCpuFrequencyMhz(80);
#endif
    Serial.println("[Boot] setup() start");

    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored

#ifndef TARGET_C3
    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
#endif
#ifndef TARGET_C3
    Serial.println("[Cal] Loaded touch calibration from NVS");
#endif
    waitMsgIdx = random(NUM_WAIT_MSGS);
    // Display (init before backlight to avoid white flash)
#ifdef TARGET_EPAPER
    // Power up display before init (on both cold boot and wake).
    if (halIsDeepSleepWake()) gpio_hold_dis(GPIO_NUM_5);  // release latch set before deep sleep
    pinMode(EPD_PWR_EN_L, OUTPUT);
    digitalWrite(EPD_PWR_EN_L, LOW);   // enable display power (active low)
    delay(10);                          // let rail stabilise
    if (halIsDeepSleepWake()) {
        // Wake display from hardware deep sleep (tft.epd.hibernate() was called before sleep).
        // Toggle RST to restart the controller before GxEPD2 init.
        pinMode(EPD_RST, OUTPUT);
        digitalWrite(EPD_RST, LOW);  delay(10);
        digitalWrite(EPD_RST, HIGH); delay(10);
    }
#endif
    tft.init();
#ifdef TARGET_EPAPER
    tft.setRotation(1);  // landscape (250 wide × 122 tall)
    if (!halIsDeepSleepWake()) {
        // Initial full-screen white clear — required before any partial updates on cold boot.
        // Skip on deep sleep wake: display retains image and selectModel() does its own full refresh.
        tft.beginFrame();
        tft.epd.fillScreen(GxEPD_WHITE);
        tft.endFrame();
    }
#elif defined(TARGET_P3)
    // ST7789P3 284×76 native landscape
    tft.setRotation(0);
#if defined(TFT_BL) && (TFT_BL >= 0)
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);
#endif
#elif defined(TARGET_C3)
    // ST7789 GRAM is 240col x 320row (portrait-native). Pre-fill all GRAM in
    // rotation 0 (CASET 0..239, RASET 0..319 both valid) so that GRAM rows
    // 240..319 contain COL_BG rather than power-on white. Without this, those
    // rows map to a visible white strip in some landscape rotations.
    tft.setRotation(0);
    tft.fillScreen(COL_BG);  // writes all 240x320 GRAM cells
    tft.setRotation(1);      // MX|MV landscape: correct physical orientation
    Serial.printf("[TFT] width=%d height=%d (expect %dx%d)\n", tft.width(), tft.height(), SCREEN_W, SCREEN_H);
#else
    #ifdef ROTATE_180
        tft.setRotation(3);
    #else
        tft.setRotation(1);
    #endif
#endif
#ifndef TARGET_EPAPER
    tft.fillScreen(invertDisplay ? COL_INVERT_BG : COL_BG);
#endif

