alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    // Hardware init (backlight, touch, LED, speaker) — delegated to HAL
    halInit();
    halLoadTouchCal(); // load saved touch calibration from NVS (or keep defaults)

    // Boot splash — plain background while connecting
    unsigned long splashStart = millis();
#ifndef TARGET_EPAPER
    tft.fillScreen(TFT_WHITE);
#endif
    bool wifiOk = connectWiFi(wifiSsid[0], wifiPass[0], true);

    // Deep sleep wake: start BLE reconnect task immediately after WiFi connects, so BLE scan
    // runs concurrently with the splash delay rather than after it. Reduces KB reconnect latency.
    // On normal boot halInit() has already connected BLE; this is a no-op (reconnectTaskHandle set).
    halStartBleReconnect();

    // Splash visible for at least 3 seconds
    long splashRemain = 3000L - (long)(millis() - splashStart);
    if (splashRemain > 0) delay(splashRemain);
#ifndef TARGET_EPAPER
    tft.fillScreen(invertDisplay ? COL_INVERT_BG : COL_BG);  // clear splash
#endif

    if (!wifiOk) {
        selectAP();  // scan → pick AP → enter password → connect; returns only on success
    }

#ifndef TARGET_EPAPER
    tft.fillScreen(invertDisplay ? COL_INVERT_BG : COL_BG);  // clear AP/splash UI before drawing model menu
#endif

#ifndef TARGET_C3
    drawKeyboard();
#endif
    drawInputBar();

    {
        uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
        uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
#if defined(TARGET_C3) && !defined(TARGET_EPAPER)
        c3Line(0,          "CRACK: Cheap Remote AI Chat Keyboard", fg, bg);
        c3Line(2 * LINE_H_P3,  "Select AI model:",       fg, bg);
#else
        uiFontOn();
        tft.setTextColor(fg, bg);
        tft.drawString("CRACK: Cheap Remote AI Chat Keyboard", 2, 0);
        tft.drawString("Select AI model:",       2, 2 * TXT_H + 4);
        uiFontOff();
#endif
    }

    selectModel();  // draws choices at y=30+ and waits for 1/2/3

    // Render the initial chat page with the correct theme.
    // selectModel() leaves a transient "Ready." display; drawHistory() replaces it
    // with the properly-themed chat layout (blank + input prompt at bottom).
    rebuildLines();
#ifdef TARGET_EPAPER
    epdMsgPending = true;   // bypass rate limit — initial render must always go through
    epdShowModel  = true;
#endif
    drawHistory();

    lastActivityMs = millis();
}

void checkWiFiHealth() {
    // 1. Check for Idle Timeout
    if (WiFi.getMode() != WIFI_OFF && (millis() - lastActivityMs > WIFI_IDLE_TIMEOUT_MS)) {
        Serial.println("[Power] 2 minutes idle. Sleeping WiFi radio.");
        WiFi.disconnect(true);
        WiFi.mode(WIFI_OFF);
        wifiHealthy = false;
        updateLedWifi();
#ifndef TARGET_EPAPER
        drawInputBar();
#endif
        return;
    }
    // 2. If intentionally asleep, skip health pings and reconnect logic
    if (WiFi.getMode() == WIFI_OFF) {
        updateLedWifi(); 
        return; 
    }

    updateLedWifi();  // instant — runs every loop, LED reacts immediately to dropout

    if (millis() - lastWiFiCheckMs < 3000) return;
    lastWiFiCheckMs = millis();

#ifndef TARGET_C3
    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);
#else
    bool ok = (WiFi.status() == WL_CONNECTED);
#endif

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
#ifndef TARGET_EPAPER
        drawInputBar();  // '>' and Send/More turn red on fail, white on recovery
#endif
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(wifiSsid[0], wifiPass[0]);
    }

#if defined(TARGET_C3) && !defined(TARGET_EPAPER)
    // Refresh WiFi signal icon every 2s; only redraw when the colour bucket changes.
    // Safe: loop() is blocked during API calls so this never races with streaming draws.
    // Skipped for TARGET_EPAPER: B&W display has no colour RSSI icon, and frequent
    // partial refreshes (500 ms each) cause the main loop to feel unresponsive.
    static unsigned long lastRssiDrawMs = 0;
    static uint16_t      lastRssiColor  = 0xFFFF;  // impossible sentinel
    if (millis() - lastRssiDrawMs >= 2000) {
        lastRssiDrawMs = millis();
        uint16_t col = rssiColor();
        if (col != lastRssiColor) {
            lastRssiColor = col;
            drawInputBar();
        }
    }
#endif
}

void loop() {
    InputEvent ev;
    if (halPollInput(&ev)) {
        lastActivityMs = millis();

        if (WiFi.getMode() == WIFI_OFF) {
            Serial.println("[Power] Activity detected. Waking WiFi...");
            WiFi.mode(WIFI_STA);
            WiFi.begin(wifiSsid[0], wifiPass[0]);
        }

        switch (ev.type) {
            case INPUT_SCROLL_UP: {
                int lineH     = LINE_H_LARGE;
#ifdef TARGET_EPAPER
                int visSlots  = (SCREEN_H - lineH) / lineH;   // 6, matches histSlots
                if (scrollOffset == 0) break;  // already at bottom — ignore
                scrollOffset  = max(0, scrollOffset - visSlots / 2);
                // Drain buffered scroll-ups accumulated while screen was refreshing
                { InputEvent peek;
                  while (halPeekInput(&peek) && peek.type == INPUT_SCROLL_UP) {
                      halPollInput(&peek);
                      scrollOffset = max(0, scrollOffset - visSlots / 2);
                  } }
                epdMsgPending = true;
#elif defined(TARGET_C3)
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                int visSlots  = maxVis - 2;  // slot 0 = heading, last = input
                scrollOffset  = max(0, scrollOffset - visSlots / 2);
#else
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                int visSlots  = maxVis;
                scrollOffset  = max(0, scrollOffset - visSlots / 2);
#endif
                drawHistory();
                break;
            }
            case INPUT_SCROLL_DOWN: {
                int lineH     = LINE_H_LARGE;
#ifdef TARGET_EPAPER
                int visSlots  = (SCREEN_H - lineH) / lineH;
                int maxScroll = max(0, lineCount - visSlots);
                if (scrollOffset >= maxScroll) break;  // already at top — ignore
                scrollOffset  = min(scrollOffset + visSlots / 2, maxScroll);
                // Drain buffered scroll-downs accumulated while screen was refreshing
                { InputEvent peek;
                  while (halPeekInput(&peek) && peek.type == INPUT_SCROLL_DOWN) {
                      halPollInput(&peek);
                      scrollOffset = min(scrollOffset + visSlots / 2, maxScroll);
                  } }
                epdMsgPending = true;
#elif defined(TARGET_C3)
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                int visSlots  = maxVis - 2;
                int maxScroll = max(0, lineCount - visSlots);
                scrollOffset  = min(scrollOffset + visSlots / 2, maxScroll);
#else
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                int visSlots  = maxVis;
                int maxScroll = max(0, lineCount - visSlots);
                scrollOffset  = min(scrollOffset + visSlots / 2, maxScroll);
#endif
                drawHistory();
                break;
            }
            case INPUT_NEW_CONV:
do_new_conv:
                historyCount = 0; lineCount = 0; scrollOffset = 0;
                moreMode = false; inputBuf[0] = '\0'; inputLen = 0; inputCursor = 0;
                history[historyCount].isUser = true;
                history[historyCount].isError = false;
                history[historyCount].displayOnly = true;
                {
                    const char* ml = useGrok ? "Grok 4.1 Fast" : useGroq ? "Groq OSS-120b" : GEMINI_MODEL;
                    char newChatBuf[64];
                    snprintf(newChatBuf, sizeof(newChatBuf), "[New chat with %s]", ml);
                    strncpy(history[historyCount].text, newChatBuf, 2047);
                }
                historyCount++;
                rebuildLines();
#ifndef TARGET_C3
                kbVisible = true;
#endif
#ifdef TARGET_EPAPER
                epdMsgPending = true;
                epdShowModel  = false;
#endif
                drawHistory();
#ifndef TARGET_EPAPER
                drawInputBar();
#endif
#ifndef TARGET_C3
                drawKeyboard();
#endif
                break;
            case INPUT_ENTER:
                // Word commands
                if (strcmp(inputBuf, "new") == 0) {
                    inputBuf[0] = '\0'; inputLen = 0; inputCursor = 0;
                    goto do_new_conv;
                }
                if (strcmp(inputBuf, "more") == 0) {
                    inputBuf[0] = '\0'; inputLen = 0; inputCursor = 0;
                    moreMode = true;
                    sendPrompt();
                    break;
                }
                if (strcmp(inputBuf, "menu") == 0) {
                    inputBuf[0] = '\0'; inputLen = 0; inputCursor = 0;
                    selectModel();
                    goto do_new_conv;
                }
                if (inputLen == 0 && historyCount == 0) break;
                sendPrompt();
                break;
            case INPUT_MORE:
                if (moreMode) sendPrompt();
                break;
            case INPUT_BACKSPACE:
                if (inputCursor > 0) {
                    memmove(inputBuf + inputCursor - 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                    inputLen--; inputCursor--;
                    if (inputLen == 0 && historyCount > 0) moreMode = true;
                    drawInputBar();
                }
                break;
            case INPUT_DELETE:
                if (inputCursor < inputLen) {
                    memmove(inputBuf + inputCursor, inputBuf + inputCursor + 1, inputLen - inputCursor);
                    inputLen--;
                    if (inputLen == 0 && historyCount > 0) moreMode = true;
                    drawInputBar();
                }
                break;
            case INPUT_CHAR:
                if (ev.ch != 0 && inputLen < INPUT_MAX_LEN) {
                    moreMode = false;
                    memmove(inputBuf + inputCursor + 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                    inputBuf[inputCursor] = ev.ch;
                    inputLen++; inputCursor++;
#ifdef TARGET_EPAPER
                    // Drain any queued chars before the 500ms display refresh.
                    { InputEvent nx;
                      while (inputLen < INPUT_MAX_LEN && halPeekInput(&nx) && nx.type == INPUT_CHAR) {
                          halPollInput(&nx);
                          if (nx.ch != 0) {
                              memmove(inputBuf + inputCursor + 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                              inputBuf[inputCursor] = nx.ch;
                              inputLen++; inputCursor++;
                          }
                      } }
#endif
                    drawInputBar();
                }
                break;
            case INPUT_CURSOR_LEFT:
                if (inputCursor > 0) { inputCursor--; drawInputBar(); }
                break;
            case INPUT_CURSOR_RIGHT:
                if (inputCursor < inputLen) { inputCursor++; drawInputBar(); }
                break;
            case INPUT_MODEL_MENU:
do_model_menu:
                selectModel();
                rebuildLines();
#ifdef TARGET_EPAPER
                epdMsgPending = true;   // bypass rate limit — model change must render immediately
                epdShowModel  = true;
#endif
                drawHistory();
#ifndef TARGET_EPAPER
                drawInputBar();
#endif
                break;
            default:
                break;
        }
    }
    checkWiFiHealth();
#ifdef TARGET_EPAPER
    if (millis() - lastActivityMs > DEEP_SLEEP_TIMEOUT_MS) {
        epdMsgPending = true;
        epdSleeping   = true;
        drawHistory();           // full refresh: chat content + "Sleeping..." input row
        if (WiFi.getMode() != WIFI_OFF) {
            WiFi.disconnect(true);
            WiFi.mode(WIFI_OFF);
            wifiHealthy = false;
        }
        saveSession();           // persist model + last 4 messages to NVS before power-off
        tft.epd.hibernate();     // put display into hardware deep sleep (lowest power)
        digitalWrite(EPD_PWR_EN_L, HIGH);  // cut display power (P-FET off)
        gpio_hold_en(GPIO_NUM_5);           // latch HIGH during deep sleep (GPIO5 is RTC-capable)
        halDeepSleep();          // deep sleep — does not return; wake reboots via setup()
        epdSleeping   = false;   // unreachable; here in case halDeepSleep() is stubbed
        lastActivityMs = millis();
        drawInputBar();
    }
#endif
    delay(20);

}